backend/controllers/PetsController.php

    protected function findModel($id)
    {
        if (($model = Pets::findOne($id)) !== null) {
---
SELECT * FROM `pets` WHERE `id`='4'