backend/controllers/TransferCurrencyController.php

    public function actionCreate()
    {
        $model = new Bill();
        $model->created_date = date('Y-m-d h:i:s');
        $model->type = 4;
        $count = Bill::countTypeBillInDay(4);
        $model->code = "TC-".date("Ymd")."-xxx-".($count+1);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `bill` (`type`, `created_date`, `customer_id`, `receiver`, `code`, `note`, `value`, `customer_type`, `deposit`, `fee`) VALUES (4, NOW(), '1', '', '', '', NULL, NULL, NULL, NULL)