backend/views/pets/index.php

SELECT * FROM `pettype` WHERE `id`='3'
---
                'attribute' => 'type',
                'format' => 'raw', //raw, html
                'content' => function($dataProvider) {
                  $m = Pettype::findOne($dataProvider['type']);