backend/models/Bill.php

SELECT * FROM `customer`
---
  public function getAllCustomer(){
    $query = Customer::find()->all();

SELECT * FROM `currency`
---
  public function getAllCurrency(){
    $query = Currency::find()->all();