backend/models/Pets.php

  public function getAllPettype() {
     $query = Pettype::find()->all();
---
SELECT * FROM `pettype`

 public function getOwner(){
   $ower = User::findOne($this->created_by);
---
SELECT * FROM `user` WHERE `id`='2'